[View in Colaboratory](https://colab.research.google.com/github/tkms0106/python-data-science/blob/master/python_data_science7_43.ipynb)

In [0]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [0]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns=['W','X','Y','Z'],
                   index=['Dog','Cat','Bird','Mouse'])

In [4]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [5]:
animals.ix[1:2, ['W','Y']] = np.nan

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [7]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [0]:
behavior_map = {'W':'bad', 'X':'good', 'Y':'bad', 'Z':'good'}

In [0]:
animals_col = animals.groupby(behavior_map, axis=1)

In [11]:
animals_col.sum()

        bad  good
Dog     2.0   4.0
Cat     0.0  12.0
Bird   18.0  20.0
Mouse  26.0  28.0

In [12]:
animals_col

In [0]:
behavior_series = Series(behavior_map)

In [14]:
behavior_series

W     bad
X    good
Y     bad
Z    good
dtype: object

In [15]:
animals.groupby(behavior_series, axis=1).count()

       bad  good
Dog      2     2
Cat      0     2
Bird     2     2
Mouse    2     2

In [18]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [0]:
keys = ['A','B','A','B']

In [20]:
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15